# Brewfile - Run with: brew bundle

# === Taps ===
tap "homebrew/cask"
tap "homebrew/cask-versions"   # if needed for betas

# === CLI Tools / Formulas ===
brew "git"
brew "gh"                      # GitHub CLI
brew "docker"
brew "yt-dlp"
brew "ffmpeg"
brew "ollama"                  # for local LLMs

# === GUI Apps (Casks) ===
cask "google-chrome"
cask "visual-studio-code"
cask "github"
cask "figma"
cask "notion"
cask "obsidian"
cask "raycast"
cask "pearcleaner"
cask "bruno"                   # API client (Postman alternative)
cask "itsycal"
cask "stats"                   # menu bar system monitor
cask "linearmouse"
cask "shottr"
cask "hazeover"
cask "hyperkey"
cask "karabiner-elements"

# === Apps that may need manual download / other sources ===
# - Claude Desktop → usually from claude.ai (not on brew)
# - ChatGPT Desktop → from openai.com (or use web version)
# - OpenWork / Opencode / Cotypist / Typewisper / Dia / Folder Peak / Atol → check official sites / Mac App Store / GitHub releases
# - Burp Suite Community Edition → official PortSwigger website (not on brew)

# Optional: Start services automatically
# brew "mas"   # if you want Mac App Store apps too
