# Brewfile - Run with: brew bundle

# === Taps ===
tap "homebrew/cask"
tap "homebrew/cask-versions"   

# === CLI Tools / Formulas ===
brew "git"
brew "gh"                      
brew "docker"
brew "yt-dlp"
brew "ffmpeg"
brew "ollama"
brew "pipx"
brew "neovim"
brew "nvm"


# === GUI Apps (Casks) ===
cask "google-chrome"
cask "visual-studio-code"
cask "github"
cask "figma"
cask "notion"
cask "obsidian"
cask "raycast"
cask "pearcleaner"
cask "bruno"                   
cask "itsycal"
cask "stats"
cask "dockdoor" 
cask "docker-desktop" 
cask "linearmouse"
cask "shottr"
cask "hazeover"
cask "hyperkey"
cask "raindropio"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "numi"
cask "google-drive"
cask "karabiner-elements"
cask "datagrip"                  
cask "tableplus"
cask "monitorcontrol"         
cask "thaw"

# === Apps that may need manual download / other sources ===
# - Claude Desktop → usually from claude.ai (not on brew)
# - ChatGPT Desktop → from openai.com (or use web version)
# - OpenWork / Opencode / Cotypist / Typewisper / Dia / Folder Peak / Atol → check official sites / Mac App Store / GitHub releases
# - Burp Suite Community Edition → official PortSwigger website (not on brew)

# Optional: Start services automatically
# brew "mas"   # if you want Mac App Store apps too
